using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IDPversion3
{
    internal class Answers
    {
        public string answerQ11 = "Появление болей в животе через 1-2 часа после приема пищи в дневное время",
            answerQ12 = "Появление болей в животе в ночное время",
            answerQ13 = "Появление болей в животе перед актом дефекации",
            answerQ14 = "Появление болей в животе после еды либо во время еды 1-2 раза в день",
            answerQ15 = "Появление болей в животе после еды либо во время еды каждый прием пищи",
            answerQ21 = "Появление специфической позы во сне",
            answerQ22 = "Появление специфической позы в дневное время через 1-2 часа после еды",
            answerQ23 = "Появление специфической позы во время еды или сразу после еды",
            answerQ31 = "Появление эпизодов в ночное время",
            answerQ32 = "Появлениеэпизодов ежедневно 1-2 раза в день",
            answerQ33 = "Появление эпизодов чаще 3 раз в неделю",
            answerQ34 = "Появление эпизодов реже 1 раза в неделю",
            answerQ41 = "Тип 1 - в форме ореха, отдельные твердые комки",
            answerQ42 = "Тип 2 -  в форме комковатой колбаски",
            answerQ43 = "Тип 3 - в форме колбаски с ребристой поверхностью",
            answerQ44 = "Тип 4 - в форме гладкой колбаски, змейки, мягкий ",
            answerQ45 = "Тип 5 - маленькие мягкие шарики с ровными краями",
            answerQ46 = "Тип 6 - рыхлые частицы с неровными краями, кашицеобразный стул",
            answerQ47 = "Тип 7 - водянистый без твердых частиц",
            answerQ51 = "Наличие патологических примесей (слизь, непереваренные комочки и тп) в копрограмме",
            answerQ52 = "Наличие примеси слизи в кале при визуальном осмотре",
            answerQ53 = "Слизь в кале обильно при визуальном осмотре",
            answerQ54 = "Наличие примеси крови в кале при визуальном осмотре",
            answerQ61 = "Прибавка в массе тела соответствует норме",
            answerQ62 = "Прибавка в массе тела недостаточные",
            answerQ63 = "Прибавка в массе тела отсутствует",
            answerQ64 = "Потеря в массе тела",
            answerQ71 = "Аппетит хороший",
            answerQ72 = "Отмечается снижение/отсутствие аппетита",
            textButtonnext = "ПРОДОЛЖИТЬ",
            textButtonend = "РЕЗУЛЬТАТЫ",
            textButtonrepeat = "СНАЧАЛА",
            textSymp = "СИМПТОМЫ",
            textResult = "РЕЗУЛЬТАТ",
            textResultpoint = " из 32 баллов";
            


    }
}
